espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
/***************************************************************************//**
 * @file
 * @brief USB Device Hid Class
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc.  Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement.
 * The software is governed by the sections of the MSLA applicable to Micrium
 * Software.
 *
 ******************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                               INCLUDE FILES
 ********************************************************************************************************
 *******************************************************************************************************/

#define    SLI_USBD_HID_MODULE

#include <stdlib.h>
#include <string.h>
#include <stddef.h>
#include <stdint.h>
#include <stdbool.h>

#include "sl_bit.h"
#include "sl_status.h"

#include "em_core.h"

#include "sl_usbd_core.h"
#include "sli_usbd_core.h"

#include "sl_usbd_class_hid.h"
#include "sli_usbd_class_hid.h"
#include "sli_usbd_class_hid_os.h"

/********************************************************************************************************
 ********************************************************************************************************
 *                                               LOCAL DEFINES
 ********************************************************************************************************
 *******************************************************************************************************/

#define  SLI_USBD_HID_CTRL_REQ_TIMEOUT_mS                  5000u

/********************************************************************************************************
 *                                       CLASS-SPECIFIC LOCAL DEFINES
 *
 * Note(s) : (1) See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 7.1 for more details about class-descriptor types.
 *
 *               (a) The 'wValue' field of Get_Descriptor Request specifies the Descriptor type in the
 *                   high byte.
 *
 *           (2) See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 7.2 for more details about class-specific requests.
 *
 *               (a) The 'bRequest' field of SETUP packet may contain one of these values.
 *******************************************************************************************************/

#define  SLI_USBD_HID_DESC_LEN                                 6u

// Class-Specific Desc (see Note #1)
#define  SLI_USBD_HID_DESC_TYPE_HID                         0x21
#define  SLI_USBD_HID_DESC_TYPE_REPORT                      0x22
#define  SLI_USBD_HID_DESC_TYPE_PHYSICAL                    0x23
// Class-Specific Req (see Note #2)
#define  SLI_USBD_HID_REQ_GET_REPORT                        0x01
#define  SLI_USBD_HID_REQ_GET_IDLE                          0x02
#define  SLI_USBD_HID_REQ_GET_PROTOCOL                      0x03
#define  SLI_USBD_HID_REQ_SET_REPORT                        0x09
#define  SLI_USBD_HID_REQ_SET_IDLE                          0x0A
#define  SLI_USBD_HID_REQ_SET_PROTOCOL                      0x0B

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL CONSTANTS
 ********************************************************************************************************
 *******************************************************************************************************/

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL GLOBAL VARIABLES
 ********************************************************************************************************
 *******************************************************************************************************/

static sli_usbd_hid_t usbd_hid_obj;
sli_usbd_hid_t *usbd_hid_ptr = NULL;

static uint32_t ctrl_status_buffer;

/********************************************************************************************************
 ********************************************************************************************************
 *                                       LOCAL FUNCTION PROTOTYPES
 ********************************************************************************************************
 *******************************************************************************************************/

static void usbd_hid_enable(uint8_t config_nbr,
                            void    *p_if_class_arg);

static void usbd_hid_disable(uint8_t config_nbr,
                             void    *p_if_class_arg);

static void usbd_hid_update_alt_setting(uint8_t config_nbr,
                                        uint8_t if_nbr,
                                        uint8_t if_alt_nbr,
                                        void    *p_if_class_arg,
                                        void    *p_if_alt_class_arg);

static void usbd_hid_update_endpoint_state(uint8_t config_nbr,
                                           uint8_t if_nbr,
                                           uint8_t if_alt_nbr,
                                           uint8_t ep_addr,
                                           void    *p_if_class_arg,
                                           void    *p_if_alt_class_arg);

static void usbd_hid_interface_descriptor_cb(uint8_t config_nbr,
                                             uint8_t if_nbr,
                                             uint8_t if_alt_nbr,
                                             void    *p_if_class_arg,
                                             void    *p_if_alt_class_arg);

