espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
static void usbd_hid_interface_descriptor_handler(void *p_if_class_arg);

static uint16_t usbd_hid_get_interface_descriptor_size(uint8_t config_nbr,
                                                       uint8_t if_nbr,
                                                       uint8_t if_alt_nbr,
                                                       void    *p_if_class_arg,
                                                       void    *p_if_alt_class_arg);

static bool usbd_hid_interface_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                               void                      *p_if_class_arg);

static bool usbd_hid_class_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                           void                      *p_if_class_arg);

static void usbd_hid_write_async_complete(uint8_t      ep_addr,
                                          void         *p_buf,
                                          uint32_t     buf_len,
                                          uint32_t     xfer_len,
                                          void         *p_arg,
                                          sl_status_t  status);

static void usbd_hid_write_sync_complete(uint8_t      ep_addr,
                                         void         *p_buf,
                                         uint32_t     buf_len,
                                         uint32_t     xfer_len,
                                         void         *p_arg,
                                         sl_status_t  status);

static void usbd_hid_read_async_complete(uint8_t      ep_addr,
                                         void         *p_buf,
                                         uint32_t     buf_len,
                                         uint32_t     xfer_len,
                                         void         *p_arg,
                                         sl_status_t  status);

static void usbd_hid_output_data_complete(uint8_t      class_nbr,
                                          void         *p_buf,
                                          uint32_t     buf_len,
                                          uint32_t     xfer_len,
                                          void         *p_arg,
                                          sl_status_t  status);

/********************************************************************************************************
 *                                           HID CLASS DRIVER
 *******************************************************************************************************/

static sl_usbd_class_driver_t usbd_hid_driver = {
  usbd_hid_enable,
  usbd_hid_disable,
  usbd_hid_update_alt_setting,
  usbd_hid_update_endpoint_state,
  usbd_hid_interface_descriptor_cb,
  usbd_hid_get_interface_descriptor_size,
  NULL,
  NULL,
  usbd_hid_interface_request_handler,
  usbd_hid_class_request_handler,
  NULL,

#if (USBD_CFG_MS_OS_DESC_EN == 1)
  NULL,
  NULL
#endif
};

/********************************************************************************************************
 ********************************************************************************************************
 *                                           GLOBAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 * Initialize HID class
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_init(void)
{
  uint8_t    ix;
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  sl_status_t     status;

  usbd_hid_ptr = &usbd_hid_obj;

  status = sli_usbd_hid_os_init();
  if (status != SL_STATUS_OK) {
    return status;
  }

  status = sli_usbd_hid_report_init();
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Init HID class struct.
  for (ix = 0u; ix < SL_USBD_HID_CLASS_INSTANCE_QUANTITY; ix++) {
    p_ctrl = &usbd_hid_ptr->ctrl_table[ix];
    p_ctrl->class_nbr = SL_USBD_CLASS_NBR_NONE;
    p_ctrl->state = SLI_USBD_HID_STATE_NONE;
    p_ctrl->comm_ptr = NULL;
    p_ctrl->subclass_code = SL_USBD_HID_SUBCLASS_NONE;
    p_ctrl->protocol_code = SL_USBD_HID_PROTOCOL_NONE;
    p_ctrl->country_code = SL_USBD_HID_COUNTRY_CODE_NOT_SUPPORTED;
    p_ctrl->report_descriptor_ptr = NULL;
    p_ctrl->report_descriptor_len = 0u;
    p_ctrl->phy_descriptor_ptr = NULL;
    p_ctrl->phy_descriptor_len = 0u;
    p_ctrl->interval_in = 0u;
    p_ctrl->interval_out = 0u;
    p_ctrl->ctrl_read_enable = true;
    p_ctrl->callback_ptr = NULL;
    p_ctrl->interrupt_write_async_function = NULL;
    p_ctrl->interrupt_write_async_arg_ptr = NULL;
    p_ctrl->interrupt_read_async_function = NULL;
    p_ctrl->interrupt_read_async_arg_ptr = NULL;

    p_ctrl->ctrl_status_buf_ptr = (uint8_t *)&ctrl_status_buffer;
    if (p_ctrl->ctrl_status_buf_ptr == NULL) {
      return SL_STATUS_ALLOCATION_FAILED;
    }
  }

  // Init HID EP tbl.
  for (ix = 0u; ix < SL_USBD_HID_CLASS_INSTANCE_QUANTITY * SL_USBD_HID_CONFIGURATION_QUANTITY; ix++) {
    p_comm = &usbd_hid_ptr->comm_tbl[ix];

    p_comm->ctrl_ptr = NULL;
    p_comm->data_interrupt_in_endpoint_address = SL_USBD_ENDPOINT_ADDR_NONE;
    p_comm->data_interrupt_out_endpoint_address = SL_USBD_ENDPOINT_ADDR_NONE;
    p_comm->data_interrupt_out_active_transfer = false;
  }

  usbd_hid_ptr->ctrl_nbr_next = SL_USBD_HID_CLASS_INSTANCE_QUANTITY;
  usbd_hid_ptr->comm_nbr_next = SL_USBD_HID_CLASS_INSTANCE_QUANTITY * SL_USBD_HID_CONFIGURATION_QUANTITY;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds a new instance of the HID class
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_create_instance(uint8_t                     subclass,
                                        uint8_t                     protocol,
                                        sl_usbd_hid_country_code_t  country_code,
                                        uint16_t                    interval_in,
                                        uint16_t                    interval_out,
                                        bool                        ctrl_rd_en,
                                        sl_usbd_hid_callbacks_t     *p_hid_callbacks,
                                        uint8_t                     *p_class_nbr)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  uint8_t    class_nbr;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

  if (p_class_nbr == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  // interval for intr IN must be a power of 2.
  if (!SLI_USBD_IS_PWR2(interval_in)) {
    *p_class_nbr = SL_USBD_CLASS_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // interval for intr OUT must be a power of 2.
  if (!((ctrl_rd_en == true) || (SLI_USBD_IS_PWR2(interval_out) == true))) {
    *p_class_nbr = SL_USBD_CLASS_NBR_NONE;
    return SL_STATUS_INVALID_PARAMETER;
  }

