espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
  CORE_ENTER_ATOMIC();
  if (usbd_hid_ptr->ctrl_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    *p_class_nbr = SL_USBD_CLASS_NBR_NONE;
    return SL_STATUS_ALLOCATION_FAILED;
  }

  usbd_hid_ptr->ctrl_nbr_next--;
  // Alloc new HID class instance.
  class_nbr = usbd_hid_ptr->ctrl_nbr_next;
  CORE_EXIT_ATOMIC();

  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];

  p_ctrl->subclass_code = subclass;
  p_ctrl->protocol_code = protocol;
  p_ctrl->country_code = country_code;
  p_ctrl->interval_in = interval_in;
  p_ctrl->interval_out = interval_out;
  p_ctrl->ctrl_read_enable = ctrl_rd_en;
  p_ctrl->callback_ptr = p_hid_callbacks;

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->get_report_desc != NULL) {
    p_ctrl->callback_ptr->get_report_desc(class_nbr,
                                          &p_ctrl->report_descriptor_ptr,
                                          &p_ctrl->report_descriptor_len);
  }

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->get_phy_desc != NULL) {
    p_ctrl->callback_ptr->get_phy_desc(class_nbr,
                                       &p_ctrl->phy_descriptor_ptr,
                                       &p_ctrl->phy_descriptor_len);
  }

  status = sli_usbd_hid_report_parse(class_nbr,
                                     p_ctrl->report_descriptor_ptr,
                                     p_ctrl->report_descriptor_len,
                                     &p_ctrl->report);

  if (status != SL_STATUS_OK) {
    *p_class_nbr = SL_USBD_CLASS_NBR_NONE;
    return status;
  }

  *p_class_nbr = class_nbr;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Adds the HID class instance to the USB device configuration
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_add_to_configuration(uint8_t  class_nbr,
                                             uint8_t  config_nbr)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint8_t    if_nbr;
  uint8_t    ep_addr;
  uint16_t    comm_nbr;
  uint16_t    interval_in;
  uint16_t    interval_out;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

  if (class_nbr >= SL_USBD_HID_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (class_nbr < usbd_hid_ptr->ctrl_nbr_next) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get HID class instance.
  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();

  if (usbd_hid_ptr->comm_nbr_next == 0u) {
    CORE_EXIT_ATOMIC();
    return SL_STATUS_ALLOCATION_FAILED;
  }

  usbd_hid_ptr->comm_nbr_next--;
  // Alloc new HID class comm info.
  comm_nbr = usbd_hid_ptr->comm_nbr_next;
  CORE_EXIT_ATOMIC();

  p_comm = &usbd_hid_ptr->comm_tbl[comm_nbr];

  // Config Desc Construction
  // See Note #2.

  // Add HID IF desc to config desc.
  status = sl_usbd_core_add_interface(config_nbr,
                                      &usbd_hid_driver,
                                      (void *)p_comm,
                                      (void *)0,
                                      SL_USBD_CLASS_CODE_HID,
                                      p_ctrl->subclass_code,
                                      p_ctrl->protocol_code,
                                      "HID Class",
                                      &if_nbr);

  if (status != SL_STATUS_OK) {
    return status;
  }

  if (SL_IS_BIT_CLEAR(config_nbr, SL_USBD_CONFIG_NBR_SPD_BIT) == true) {
    // In FS, bInterval in frames.
    interval_in = p_ctrl->interval_in;
    interval_out = p_ctrl->interval_out;
  } else {
    // In HS, bInterval in microframes.
    interval_in = p_ctrl->interval_in * 8u;
    interval_out = p_ctrl->interval_out * 8u;
  }

  // Add intr IN EP desc.
  status = sl_usbd_core_add_interrupt_endpoint(config_nbr,
                                               if_nbr,
                                               0u,
                                               true,
                                               0u,
                                               interval_in,
                                               &ep_addr);

  if (status != SL_STATUS_OK) {
    return status;
  }

  // Store intr IN EP addr.
  p_comm->data_interrupt_in_endpoint_address = ep_addr;

  if (p_ctrl->ctrl_read_enable == false) {
    // Add intr OUT EP desc.
    status = sl_usbd_core_add_interrupt_endpoint(config_nbr,
                                                 if_nbr,
                                                 0u,
                                                 false,
                                                 0u,
                                                 interval_out,
                                                 &ep_addr);

    if (status != SL_STATUS_OK) {
      return status;
    }
  } else {
    ep_addr = SL_USBD_ENDPOINT_ADDR_NONE;
  }

  // Store intr OUT EP addr.
  p_comm->data_interrupt_out_endpoint_address = ep_addr;

  // Store HID class instance info.
  CORE_ENTER_ATOMIC();
  p_ctrl->class_nbr = class_nbr;
  p_ctrl->state = SLI_USBD_HID_STATE_INIT;
  CORE_EXIT_ATOMIC();

  p_comm->ctrl_ptr = p_ctrl;

  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Gets the HID class enable state
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_is_enabled(uint8_t  class_nbr,
                                   bool     *p_enabled)
{
  sli_usbd_hid_ctrl_t  *p_ctrl;
  sl_usbd_device_state_t state;
  sl_status_t      status;

  if (p_enabled == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_HID_CLASS_INSTANCE_QUANTITY) {
    *p_enabled = false;
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (class_nbr < usbd_hid_ptr->ctrl_nbr_next) {
    *p_enabled = false;
    return SL_STATUS_INVALID_PARAMETER;
  }

