espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
  // Get HID class instance.
  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];
  // Get dev state.
  status = sl_usbd_core_get_device_state(&state);

  if ((status == SL_STATUS_OK)
      && (state == SL_USBD_DEVICE_STATE_CONFIGURED)
      && (p_ctrl->state == SLI_USBD_HID_STATE_CONFIG)) {
    *p_enabled = true;
    return SL_STATUS_OK;
  } else {
    *p_enabled = false;
    return status;
  }
}

/****************************************************************************************************//**
 * Receives  data from the host through the Interrupt OUT endpoint. This function is blocking.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_read_sync(uint8_t    class_nbr,
                                  void       *p_buf,
                                  uint32_t   buf_len,
                                  uint16_t   timeout,
                                  uint32_t   *p_xfer_len)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint32_t    xfer_len;
  bool   conn;
  sl_status_t     status;
  sl_status_t     local_status;
  CORE_DECLARE_IRQ_STATE;

  if (p_xfer_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if ((p_buf == NULL) && (buf_len != 0)) {
    *p_xfer_len = 0u;
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_HID_CLASS_INSTANCE_QUANTITY) {
    *p_xfer_len = 0u;
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (class_nbr < usbd_hid_ptr->ctrl_nbr_next) {
    *p_xfer_len = 0u;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get HID class instance.
  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();
  p_comm = p_ctrl->comm_ptr;
  sl_usbd_hid_is_enabled(class_nbr, &conn);
  CORE_EXIT_ATOMIC();

  // Chk class state.
  if (conn != true) {
    *p_xfer_len = 0u;
    return SL_STATUS_INVALID_STATE;
  }

  // Use SET_REPORT to rx data instead.
  if (p_ctrl->ctrl_read_enable == true) {
    status = sli_usbd_hid_os_lock_output(class_nbr);

    if (status != SL_STATUS_OK) {
      *p_xfer_len = 0u;
      return status;
    }

    if (p_ctrl->is_rx == true) {
      sli_usbd_hid_os_unlock_output(class_nbr);
      *p_xfer_len = 0u;
      return SL_STATUS_FAIL;
    }
    p_ctrl->is_rx = true;
    p_ctrl->rx_buf_len = buf_len;
    p_ctrl->rx_buf_ptr = (uint8_t *)p_buf;
    // Save app rx callback.
    p_ctrl->interrupt_read_async_function = usbd_hid_output_data_complete;
    p_ctrl->interrupt_read_async_arg_ptr = &xfer_len;

    sli_usbd_hid_os_unlock_output(class_nbr);
    local_status = sli_usbd_hid_os_pend_output(class_nbr, timeout);
    status = sli_usbd_hid_os_lock_output(class_nbr);

    if (status != SL_STATUS_OK) {
      *p_xfer_len = 0u;
      return status;
    }

    status = local_status;

    if (status == SL_STATUS_TIMEOUT) {
      p_ctrl->rx_buf_len = 0u;
      p_ctrl->rx_buf_ptr = (uint8_t *)0;

      p_ctrl->interrupt_read_async_function = 0;
      p_ctrl->interrupt_read_async_arg_ptr = 0;

      p_ctrl->is_rx = false;

      sli_usbd_hid_os_unlock_output(class_nbr);

      *p_xfer_len = 0u;
      return status;
    }

    sli_usbd_hid_os_unlock_output(class_nbr);

    if (status != SL_STATUS_OK) {
      *p_xfer_len = 0u;
      return status;
    }

    *p_xfer_len = xfer_len;
    return SL_STATUS_OK;
  }

  // Intr Out Comm
  status = sl_usbd_core_read_interrupt_sync(p_comm->data_interrupt_out_endpoint_address,
                                            p_buf,
                                            buf_len,
                                            timeout,
                                            &xfer_len);

  if (status != SL_STATUS_OK) {
    *p_xfer_len = 0u;
    return status;
  }

  *p_xfer_len = xfer_len;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Receives  data from the host through the Interrupt OUT endpoint. This function is non-blocking.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_read_async(uint8_t                      class_nbr,
                                   void                         *p_buf,
                                   uint32_t                     buf_len,
                                   sl_usbd_hid_async_function_t async_fnct,
                                   void                         *p_async_arg)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  bool   conn;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

  if ((p_buf == NULL) && (buf_len != 0)) {
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_HID_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (class_nbr < usbd_hid_ptr->ctrl_nbr_next) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get HID class instance.
  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();
  p_comm = p_ctrl->comm_ptr;
  sl_usbd_hid_is_enabled(class_nbr, &conn);
  CORE_EXIT_ATOMIC();

  // Chk class state.
  if (conn != true) {
    return SL_STATUS_INVALID_STATE;
  }

  // Use SET_REPORT to rx data instead.
  if (p_ctrl->ctrl_read_enable == true) {
    status = sli_usbd_hid_os_lock_output(class_nbr);

    if (status != SL_STATUS_OK) {
      return status;
    }

    if (p_ctrl->is_rx == true) {
      sli_usbd_hid_os_unlock_output(class_nbr);
      return SL_STATUS_FAIL;
    }

    p_ctrl->is_rx = true;
    p_ctrl->rx_buf_len = buf_len;
    p_ctrl->rx_buf_ptr = (uint8_t *)p_buf;
    // Save app rx callback.
    p_ctrl->interrupt_read_async_function = async_fnct;
    p_ctrl->interrupt_read_async_arg_ptr = p_async_arg;

    sli_usbd_hid_os_unlock_output(class_nbr);
  } else {
    // Save app rx callback.
    CORE_ENTER_ATOMIC();
    p_ctrl->interrupt_read_async_function = async_fnct;
    p_ctrl->interrupt_read_async_arg_ptr = p_async_arg;
    // Intr Out Comm
    // Check if another xfer is already in progress.
    if (p_comm->data_interrupt_out_active_transfer == false) {
      // Indicate that a xfer is in progress.
      p_comm->data_interrupt_out_active_transfer = true;
      CORE_EXIT_ATOMIC();

      status = sl_usbd_core_read_interrupt_async(p_comm->data_interrupt_out_endpoint_address,
                                                 p_buf,
                                                 buf_len,
                                                 usbd_hid_read_async_complete,
                                                 (void *)p_comm);

