espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
      if (status != SL_STATUS_OK) {
        CORE_ENTER_ATOMIC();
        p_comm->data_interrupt_out_active_transfer = false;
        CORE_EXIT_ATOMIC();
      }
    } else {
      CORE_ENTER_ATOMIC();
      return SL_STATUS_NOT_READY;
    }
  }

  return status;
}

/****************************************************************************************************//**
 * Sends data to the host through the Interrupt IN endpoint. This function is blocking.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_write_sync(uint8_t    class_nbr,
                                   void       *p_buf,
                                   uint32_t   buf_len,
                                   uint16_t   timeout,
                                   uint32_t   *p_xfer_len)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint32_t    xfer_len;
  uint8_t    report_id;
  uint8_t    *p_buf_data;
  uint8_t    *p_buf_report;
  uint16_t    report_len;
  bool   is_largest;
  bool   conn;
  bool   eot;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

  if (p_xfer_len == NULL) {
    return SL_STATUS_NULL_POINTER;
  }

  if ((p_buf == NULL) && (buf_len != 0)) {
    *p_xfer_len = 0u;
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_HID_CLASS_INSTANCE_QUANTITY) {
    *p_xfer_len = 0u;
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (class_nbr < usbd_hid_ptr->ctrl_nbr_next) {
    *p_xfer_len = 0u;
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get HID class instance.
  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();
  p_comm = p_ctrl->comm_ptr;
  sl_usbd_hid_is_enabled(class_nbr, &conn);
  CORE_EXIT_ATOMIC();

  // Chk class state.
  if (conn != true) {
    *p_xfer_len = 0u;
    return SL_STATUS_INVALID_STATE;
  }

  // Store Report Data
  if (buf_len > 0) {
    p_buf_data = (uint8_t *)p_buf;
    if (p_ctrl->report.has_reports == true) {
      report_id = p_buf_data[0];
    } else {
      report_id = 0;
    }

    status = sli_usbd_hid_report_get_info(&p_ctrl->report,
                                          SLI_USBD_HID_REPORT_TYPE_INPUT,
                                          report_id,
                                          &p_buf_report,
                                          &is_largest,
                                          &report_len);

    if (status != SL_STATUS_OK) {
      *p_xfer_len = 0u;
      return status;
    }

    if (report_len > buf_len) {
      *p_xfer_len = 0u;
      return SL_STATUS_INVALID_PARAMETER;
    }

    eot = !is_largest;
  } else {
    p_buf_data = (uint8_t *)0;
    p_buf_report = (uint8_t *)0;
    report_len = 0;
    eot = true;
  }

  status = sli_usbd_hid_os_lock_tx(class_nbr);

  if (status != SL_STATUS_OK) {
    *p_xfer_len = 0u;
    return status;
  }

  // Intr In Comm
  status = sl_usbd_core_write_interrupt_async(p_comm->data_interrupt_in_endpoint_address,
                                              p_buf,
                                              buf_len,
                                              usbd_hid_write_sync_complete,
                                              (void *)p_comm,
                                              eot);

  if (status != SL_STATUS_OK) {
    sli_usbd_hid_os_unlock_tx(class_nbr);
    *p_xfer_len = 0u;
    return status;
  }

  // Defer copy while transmitting.
  if (buf_len > 0) {
    status = sli_usbd_hid_os_lock_input(class_nbr);

    if (status != SL_STATUS_OK) {
      sli_usbd_hid_os_unlock_tx(class_nbr);
      *p_xfer_len = 0u;
      return status;
    }

    memcpy(&p_buf_report[0], &p_buf_data[0], report_len);
    sli_usbd_hid_os_unlock_input(class_nbr);
  }

  status = sli_usbd_hid_os_pend_input(class_nbr, timeout);

  if (status != SL_STATUS_OK) {
    if (status == SL_STATUS_TIMEOUT) {
      status = sl_usbd_core_abort_endpoint(p_comm->data_interrupt_in_endpoint_address);
    }

    sli_usbd_hid_os_unlock_tx(class_nbr);

    *p_xfer_len = 0u;
    return status;
  }

  xfer_len = p_ctrl->data_interrupt_in_transfer_len;

  sli_usbd_hid_os_unlock_tx(class_nbr);

  *p_xfer_len = xfer_len;
  return SL_STATUS_OK;
}

/****************************************************************************************************//**
 * Sends data to the host through the Interrupt IN endpoint. This function is non-blocking.
 *******************************************************************************************************/
sl_status_t sl_usbd_hid_write_async(uint8_t                      class_nbr,
                                    void                         *p_buf,
                                    uint32_t                     buf_len,
                                    sl_usbd_hid_async_function_t async_fnct,
                                    void                         *p_async_arg)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint8_t    report_id;
  uint8_t    *p_buf_data;
  uint8_t    *p_buf_report;
  uint16_t    report_len;
  bool   is_largest;
  bool   conn;
  bool   eot;
  sl_status_t     status;
  CORE_DECLARE_IRQ_STATE;

  if ((p_buf == NULL) && (buf_len != 0)) {
    return SL_STATUS_NULL_POINTER;
  }

  if (class_nbr >= SL_USBD_HID_CLASS_INSTANCE_QUANTITY) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  if (class_nbr < usbd_hid_ptr->ctrl_nbr_next) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  // Get HID class instance.
  p_ctrl = &usbd_hid_ptr->ctrl_table[class_nbr];

  CORE_ENTER_ATOMIC();
  p_comm = p_ctrl->comm_ptr;
  sl_usbd_hid_is_enabled(class_nbr, &conn);
  CORE_EXIT_ATOMIC();

  // Chk class state.
  if (conn != true) {
    return SL_STATUS_INVALID_STATE;
  }

  // Store Report Data
  if (buf_len > 0) {
    p_buf_data = (uint8_t *)p_buf;

    if (p_ctrl->report.has_reports == true) {
      report_id = p_buf_data[0];
    } else {
      report_id = 0;
    }

    status = sli_usbd_hid_report_get_info(&p_ctrl->report,
                                          SLI_USBD_HID_REPORT_TYPE_INPUT,
                                          report_id,
                                          &p_buf_report,
                                          &is_largest,
                                          &report_len);

