espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
    if (status != SL_STATUS_OK) {
      return status;
    }

    if (report_len > buf_len) {
      return SL_STATUS_INVALID_PARAMETER;
    }

    eot = !is_largest;
  } else {
    p_buf_data = (uint8_t *)0;
    p_buf_report = (uint8_t *)0;
    report_len = 0;
    eot = true;
  }

  status = sli_usbd_hid_os_lock_tx(class_nbr);

  if (status != SL_STATUS_OK) {
    return status;
  }

  // Save app rx callback.
  p_ctrl->interrupt_write_async_function = async_fnct;
  p_ctrl->interrupt_write_async_arg_ptr = p_async_arg;

  // Intr In Comm
  status = sl_usbd_core_write_interrupt_async(p_comm->data_interrupt_in_endpoint_address,
                                              p_buf,
                                              buf_len,
                                              usbd_hid_write_async_complete,
                                              (void *)p_comm,
                                              eot);

  if (status != SL_STATUS_OK) {
    sli_usbd_hid_os_unlock_tx(class_nbr);
    return status;
  }

  // Defer copy while transmitting.
  if (buf_len > 0) {
    status = sli_usbd_hid_os_lock_input(class_nbr);

    if (status != SL_STATUS_OK) {
      sli_usbd_hid_os_unlock_tx(class_nbr);
      return status;
    }

    memcpy(&p_buf_report[0], &p_buf_data[0], report_len);

    sli_usbd_hid_os_unlock_input(class_nbr);
  }

  return SL_STATUS_OK;
}

/********************************************************************************************************
 ********************************************************************************************************
 *                                           LOCAL FUNCTIONS
 ********************************************************************************************************
 *******************************************************************************************************/

/****************************************************************************************************//**
 *                                               usbd_hid_enable()
 *
 * @brief    Notify class that configuration is active.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    p_if_class_arg  Pointer to class argument specific to interface.
 *******************************************************************************************************/
static void usbd_hid_enable(uint8_t  config_nbr,
                            void     *p_if_class_arg)
{
  sli_usbd_hid_comm_t *p_comm;
  sli_usbd_hid_ctrl_t *p_ctrl;
  CORE_DECLARE_IRQ_STATE;

  (void)&config_nbr;

  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  CORE_ENTER_ATOMIC();
  p_ctrl->comm_ptr = p_comm;
  p_ctrl->state = SLI_USBD_HID_STATE_CONFIG;
  CORE_EXIT_ATOMIC();

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->enable != NULL) {
    p_ctrl->callback_ptr->enable(p_ctrl->class_nbr);
  }
}

/****************************************************************************************************//**
 *                                           usbd_hid_disable()
 *
 * @brief    Notify class that configuration is not active.
 *
 * @param    config_nbr      Configuration number.
 *
 * @param    p_if_class_arg  Pointer to class argument specific to interface.
 *******************************************************************************************************/
static void usbd_hid_disable(uint8_t    config_nbr,
                             void       *p_if_class_arg)
{
  sli_usbd_hid_comm_t *p_comm;
  sli_usbd_hid_ctrl_t *p_ctrl;
  CORE_DECLARE_IRQ_STATE;

  (void)&config_nbr;

  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  sli_usbd_hid_report_remove_all_idle(&p_ctrl->report);

  CORE_ENTER_ATOMIC();
  p_ctrl->comm_ptr = (sli_usbd_hid_comm_t *)0;
  p_ctrl->state = SLI_USBD_HID_STATE_INIT;
  if (p_ctrl->is_rx == true) {
    CORE_EXIT_ATOMIC();

    p_ctrl->interrupt_read_async_function(p_ctrl->class_nbr,
                                          p_ctrl->rx_buf_ptr,
                                          p_ctrl->rx_buf_len,
                                          0,
                                          (void *)p_ctrl->interrupt_read_async_arg_ptr,
                                          SL_STATUS_ABORT);

    CORE_ENTER_ATOMIC();
    p_ctrl->is_rx = false;
    p_ctrl->rx_buf_len = 0;
    p_ctrl->rx_buf_ptr = (uint8_t *)0;

    p_ctrl->interrupt_read_async_function = 0;
    p_ctrl->interrupt_read_async_arg_ptr = 0;
    CORE_EXIT_ATOMIC();
  } else {
    CORE_EXIT_ATOMIC();
  }

  if (p_ctrl->callback_ptr != NULL && p_ctrl->callback_ptr->disable != NULL) {
    p_ctrl->callback_ptr->disable(p_ctrl->class_nbr);
  }
}

/****************************************************************************************************//**
 *                                       usbd_hid_update_alt_setting()
 *
 * @brief    Notify class that interface alternate setting has been updated.
 *
 * @param    config_nbr          Configuration number.
 *
 * @param    if_nbr              Interface number.
 *
 * @param    if_alt_nbr          Interface alternate setting number.
 *
 * @param    p_if_class_arg      Pointer to class argument specific to interface.
 *
 * @param    p_if_alt_class_arg  Pointer to class argument specific to alternate interface.
 *******************************************************************************************************/
static void usbd_hid_update_alt_setting(uint8_t    config_nbr,
                                        uint8_t    if_nbr,
                                        uint8_t    if_alt_nbr,
                                        void       *p_if_class_arg,
                                        void       *p_if_alt_class_arg)
{
  sli_usbd_hid_comm_t *p_comm;
  CORE_DECLARE_IRQ_STATE;

  (void)&config_nbr;
  (void)&if_nbr;
  (void)&if_alt_nbr;
  (void)&p_if_alt_class_arg;

  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  CORE_ENTER_ATOMIC();
  p_comm->ctrl_ptr->comm_ptr = p_comm;
  CORE_EXIT_ATOMIC();
}

/********************************************************************************************************
 *                                       usbd_hid_update_endpoint_state()
 *
 * Description : Notify class that endpoint state has been updated.
 *
 * Argument(s) : config_nbr          Configuration number.
 *
 *               if_nbr              Interface number.
 *
 *               if_alt_nbr          Interface alternate setting number.
 *
 *               ep_addr             Endpoint address.
 *
 *               p_if_class_arg      Pointer to class argument specific to interface.
 *
 *               p_if_alt_class_arg  Pointer to class argument specific to alternate interface.
 *
 * Return(s)   : None.
 *
 * Note(s)     : (1) EP state may have changed, it can be checked through sl_usbd_core_is_endpoint_stalled().
 *******************************************************************************************************/
static void usbd_hid_update_endpoint_state(uint8_t    config_nbr,
                                           uint8_t    if_nbr,
                                           uint8_t    if_alt_nbr,
                                           uint8_t    ep_addr,
                                           void       *p_if_class_arg,
                                           void       *p_if_alt_class_arg)

{
  (void)&config_nbr;
  (void)&if_nbr;
  (void)&if_alt_nbr;
  (void)&ep_addr;
  (void)&p_if_class_arg;
  (void)&p_if_alt_class_arg;
}

/****************************************************************************************************//**
 *                                           usbd_hid_interface_descriptor_cb()
 *
 * @brief    Class interface descriptor callback.
 *
 * @param    config_nbr          Configuration number.
 *
 * @param    if_nbr              Interface number.
 *
 * @param    if_alt_nbr          Interface alternate setting number.
 *
 * @param    p_if_class_arg      Pointer to class argument specific to interface.
 *
 * @param    p_if_alt_class_arg  Pointer to class argument specific to alternate interface.
 *******************************************************************************************************/
static void usbd_hid_interface_descriptor_cb(uint8_t    config_nbr,
                                             uint8_t    if_nbr,
                                             uint8_t    if_alt_nbr,
                                             void       *p_if_class_arg,
                                             void       *p_if_alt_class_arg)

{
  (void)&config_nbr;
  (void)&if_nbr;
  (void)&if_alt_nbr;
  (void)&p_if_alt_class_arg;

  usbd_hid_interface_descriptor_handler(p_if_class_arg);
}

/****************************************************************************************************//**
 *                                           usbd_hid_interface_descriptor_handler()
 *
 * @brief    Class interface descriptor callback handler.
 *
 * @param    p_if_class_arg  Pointer to class argument.
 *******************************************************************************************************/
static void usbd_hid_interface_descriptor_handler(void       *p_if_class_arg)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint8_t    nbr_desc;

