espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  nbr_desc = 0u;
  if (p_ctrl->report_descriptor_len > 0u) {
    nbr_desc++;
  }
  if (p_ctrl->phy_descriptor_len > 0u) {
    nbr_desc++;
  }

  sl_usbd_core_write_08b_to_descriptor_buf(SLI_USBD_HID_DESC_LEN + nbr_desc * 3u);
  sl_usbd_core_write_08b_to_descriptor_buf(SLI_USBD_HID_DESC_TYPE_HID);
  sl_usbd_core_write_16b_to_descriptor_buf(0x0111);
  sl_usbd_core_write_08b_to_descriptor_buf((uint8_t)p_ctrl->country_code);
  sl_usbd_core_write_08b_to_descriptor_buf(nbr_desc);

  if (p_ctrl->report_descriptor_len > 0u) {
    sl_usbd_core_write_08b_to_descriptor_buf(SLI_USBD_HID_DESC_TYPE_REPORT);
    sl_usbd_core_write_16b_to_descriptor_buf(p_ctrl->report_descriptor_len);
  }
  if (p_ctrl->phy_descriptor_len > 0u) {
    sl_usbd_core_write_08b_to_descriptor_buf(SLI_USBD_HID_DESC_TYPE_PHYSICAL);
    sl_usbd_core_write_16b_to_descriptor_buf(p_ctrl->phy_descriptor_len);
  }
}

/****************************************************************************************************//**
 *                                           usbd_hid_get_interface_descriptor_size()
 *
 * @brief    Retrieve the size of the class interface descriptor.
 *
 * @param    config_nbr          Configuration number.
 *
 * @param    if_nbr              Interface number.
 *
 * @param    if_alt_nbr          Interface alternate setting number.
 *
 * @param    p_if_class_arg      Pointer to class argument specific to interface.
 *
 * @param    p_if_alt_class_arg  Pointer to class argument specific to alternate interface.
 *
 * @return   size of the class interface descriptor.
 *******************************************************************************************************/
static uint16_t usbd_hid_get_interface_descriptor_size(uint8_t    config_nbr,
                                                       uint8_t    if_nbr,
                                                       uint8_t    if_alt_nbr,
                                                       void       *p_if_class_arg,
                                                       void       *p_if_alt_class_arg)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint8_t    nbr_desc;

  (void)&config_nbr;
  (void)&if_nbr;
  (void)&if_alt_nbr;
  (void)&p_if_alt_class_arg;

  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;

  nbr_desc = 0u;
  if (p_ctrl->report_descriptor_len > 0u) {
    nbr_desc++;
  }
  if (p_ctrl->phy_descriptor_len > 0u) {
    nbr_desc++;
  }

  return (SLI_USBD_HID_DESC_LEN + nbr_desc * 3u);
}

/****************************************************************************************************//**
 *                                               usbd_hid_interface_request_handler()
 *
 * @brief    Process interface requests.
 *
 * @param    p_setup_req     Pointer to setup request structure.
 *
 * @param    p_if_class_arg  Pointer to class argument specific to interface.
 *
 * @return   true,   if NO error(s) occurred and request is supported.
 *
 *           false, if any errors are returned.
 *
 * @note     (1) HID class supports 3 class-specific descriptors:
 *
 *           - (a) HID      descriptor (mandatory)
 *
 *           - (a) report   descriptor (mandatory)
 *
 *           - (a) Physical descriptor (optional)
 *
 *               HID descriptor is sent to Host as part of the Configuration descriptor. report and
 *               Physical descriptors are retrieved by the host using a GET_DESCRIPTOR standard request
 *               with the recipient being the interface. The way to get report and Physical descriptors
 *               is specific to the HID class. The HID class specification indicates in the section
 *               '7.1 Standard Requests':
 *
 *               "The HID class uses the standard request Get_Descriptor as described in the USB Specification.
 *               When a Get_Descriptor(Configuration) request is issued, it returns the Configuration descriptor,
 *               all Interface descriptors, all Endpoint descriptors, and the HID descriptor for each interface.
 *               It shall not return the String descriptor, HID report descriptor or any of the
 *               optional HID class descriptors."
 *
 * @note     (2) The HID descriptor identifies the length and type of subordinate descriptors for a
 *               device.
 *               See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 6.2.1 for more details about HID descriptor.
 *
 * @note     (3) The report descriptor is made up of items that provide information about the device.
 *               The first part of an item contains three fields: item type, item tag, and item size.
 *               Together these fields identify the kind of information the item provides.
 *               See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 6.2.2 for more details about report descriptor.
 *
 * @note     (4) A Physical Descriptor is a data structure that provides information about the
 *               specific part or parts of the human body that are activating a control or controls.
 *               See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 6.2.3 for more details about Physical descriptor.
 *
 *           - (a) Descriptor set 0 is a special descriptor set that specifies the number of additional
 *                   descriptor sets, and also the number of Physical Descriptors in each set.
 *******************************************************************************************************/
static bool usbd_hid_interface_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                               void                      *p_if_class_arg)
{
  sli_usbd_hid_comm_t *p_comm;
  bool   valid;
  bool   dev_to_host;
  uint8_t    desc_type;
  uint8_t    w_value;
  uint16_t    desc_len;
  uint32_t    desc_offset;

