espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  valid = false;

  dev_to_host = SL_IS_BIT_SET(p_setup_req->bmRequestType, SL_USBD_REQ_DIR_BIT);

  // Get Descriptor (see Note #1)
  if (p_setup_req->bRequest == SL_USBD_REQ_GET_DESCRIPTOR) {
    if (dev_to_host != true) {
      return (valid);
    }
    // Get desc type.
    desc_type = (uint8_t)((p_setup_req->wValue >> 8u) & 0xFFu);
    w_value = (uint8_t) (p_setup_req->wValue        & 0xFFu);

    switch (desc_type) {
      case SLI_USBD_HID_DESC_TYPE_HID:
        if (w_value != 0) {
          break;
        }

        usbd_hid_interface_descriptor_handler(p_if_class_arg);
        valid = true;
        break;

      case SLI_USBD_HID_DESC_TYPE_REPORT:
        if (w_value != 0) {
          break;
        }

        if (p_comm->ctrl_ptr->report_descriptor_len > 0) {
          sl_usbd_core_write_buf_to_descriptor_buf(p_comm->ctrl_ptr->report_descriptor_ptr,
                                                   p_comm->ctrl_ptr->report_descriptor_len);
          valid = true;
        }
        break;

      case SLI_USBD_HID_DESC_TYPE_PHYSICAL:
        if (p_comm->ctrl_ptr->phy_descriptor_len < 3) {
          break;
        }

        if (w_value > 0) {
          memcpy(&desc_len, (p_comm->ctrl_ptr->phy_descriptor_ptr + 1), 2u);
          desc_offset = desc_len * (w_value - 1) + 3;

          if (p_comm->ctrl_ptr->phy_descriptor_len < (desc_offset + desc_len)) {
            break;
          }

          sl_usbd_core_write_buf_to_descriptor_buf(&p_comm->ctrl_ptr->phy_descriptor_ptr[desc_offset],
                                                   desc_len);
        } else {
          // See Note #4a.
          sl_usbd_core_write_buf_to_descriptor_buf(p_comm->ctrl_ptr->phy_descriptor_ptr,
                                                   3);
        }

        valid = true;
        break;

      // Other desc type not supported.
      default:
        break;
    }
  }

  return (valid);
}

/****************************************************************************************************//**
 *                                           usbd_hid_class_request_handler()
 *
 * @brief    Process class-specific requests.
 *
 * @param    p_setup_req     Pointer to setup request structure.
 *
 * @param    p_if_class_arg  Pointer to class argument specific to interface.
 *
 * @return   true,   if NO error(s) occurred and request is supported.
 *
 *           false, if any errors are returned.
 *
 * @note     (1) HID defines the following class-specific requests :
 *
 *           - (a) GET_REPORT   allows the host to receive a report.
 *
 *           - (b) SET_REPORT   allows the host to send a report to the device, possibly setting
 *                               the state of input, output, or feature controls.
 *
 *           - (c) GET_IDLE     reads the current idle rate for a particular Input report.
 *
 *           - (d) SET_IDLE     silences a particular report on the Interrupt In pipe until a
 *                               new event occurs or the specified amount of time passes.
 *
 *           - (e) GET_PROTOCOL reads which protocol is currently active (either the boot
 *                               protocol or the report protocol).
 *
 *               - (1) protocol is either BOOT or REPORT.
 *
 *           - (f) SET_PROTOCOL switches between the boot protocol and the report protocol (or
 *                               vice versa).
 *
 *               See 'Device Class Definition for Human Interface Devices (HID), 6/27/01, Version 1.11',
 *               section 7.2 for more details about Class-Specific Requests.
 *******************************************************************************************************/
static bool usbd_hid_class_request_handler(const sl_usbd_setup_req_t *p_setup_req,
                                           void                      *p_if_class_arg)
{
  sli_usbd_hid_comm_t     *p_comm;
  sli_usbd_hid_ctrl_t     *p_ctrl;
  bool       valid;
  bool       dev_to_host;
  uint8_t        idle_rate;
  uint8_t        report_id;
  uint8_t        report_type;
  uint16_t        report_len;
  uint8_t        protocol;
  uint8_t        *p_buf;
  uint32_t        buf_len;
  uint16_t        req_len;
  uint8_t        w_value;
  bool       is_largest;
  sl_usbd_hid_callbacks_t *p_callback;
  uint32_t        xfer_len;
  sl_status_t         status;

  p_comm = (sli_usbd_hid_comm_t *)p_if_class_arg;
  p_ctrl = p_comm->ctrl_ptr;
  valid = false;
  p_callback = p_ctrl->callback_ptr;

  dev_to_host = SL_IS_BIT_SET(p_setup_req->bmRequestType, SL_USBD_REQ_DIR_BIT);

  // See Note #1.
  switch (p_setup_req->bRequest) {
    case SLI_USBD_HID_REQ_GET_REPORT:
      if (dev_to_host != true) {
        break;
      }

      report_type = (uint8_t)((p_setup_req->wValue >> 8u) & 0xFFu);
      report_id = (uint8_t)(p_setup_req->wValue        & 0xFFu);

      switch (report_type) {
        case 1:
          // Input report.
          status = sli_usbd_hid_report_get_info(&p_ctrl->report,
                                                SLI_USBD_HID_REPORT_TYPE_INPUT,
                                                report_id,
                                                &p_buf,
                                                &is_largest,
                                                &report_len);
          if (status != SL_STATUS_OK) {
            break;
          }

          // Get min between req len & report size.
          buf_len = SLI_USBD_GET_MIN(p_setup_req->wLength, report_len);

          status = sli_usbd_hid_os_lock_input(p_ctrl->class_nbr);

          if (status != SL_STATUS_OK) {
            break;
          }

          // Send report to host.
          status = sl_usbd_core_write_control_sync((void *)p_buf,
                                                   buf_len,
                                                   SLI_USBD_HID_CTRL_REQ_TIMEOUT_mS,
                                                   false,
                                                   &xfer_len);

          if (status == SL_STATUS_OK) {
            valid = true;
          }

          sli_usbd_hid_os_unlock_input(p_ctrl->class_nbr);
          break;

        case 3:
          // Feature report.
          if ((p_callback == (sl_usbd_hid_callbacks_t *)0)
              || (p_callback->get_feature_report == NULL)) {
            break;                                              // Stall request.
          }

          status = sli_usbd_hid_report_get_info(&p_ctrl->report,
                                                SLI_USBD_HID_REPORT_TYPE_FEATURE,
                                                report_id,
                                                &p_buf,
                                                &is_largest,
                                                &report_len);

