espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
          if (status != SL_STATUS_OK) {
            break;
          }

          // Get min between req len & report size.
          req_len = SLI_USBD_GET_MIN(p_setup_req->wLength, report_len);
          p_callback->get_feature_report(p_ctrl->class_nbr,
                                         report_id,
                                         p_buf,
                                         req_len);

          // Send report to host.
          status = sl_usbd_core_write_control_sync((void *)p_buf,
                                                   req_len,
                                                   SLI_USBD_HID_CTRL_REQ_TIMEOUT_mS,
                                                   false,
                                                   &xfer_len);

          if (status == SL_STATUS_OK) {
            valid = true;
          }
          break;

        case 0:
        default:
          break;
      }
      break;

    case SLI_USBD_HID_REQ_SET_REPORT:
      if (dev_to_host != false) {
        break;
      }

      report_type = (uint8_t)((p_setup_req->wValue >> 8u) & 0xFFu);
      report_id = (uint8_t)(p_setup_req->wValue        & 0xFFu);

      switch (report_type) {
        case 2:
          // Output report.
          if ((p_callback == (sl_usbd_hid_callbacks_t *)0)
              || (p_callback->set_output_report == NULL)) {
            break;                                              // Stall request.
          }

          status = sli_usbd_hid_report_get_info(&p_ctrl->report,
                                                SLI_USBD_HID_REPORT_TYPE_OUTPUT,
                                                report_id,
                                                &p_buf,
                                                &is_largest,
                                                &report_len);

          if (status != SL_STATUS_OK) {
            break;
          }

          status = sli_usbd_hid_os_lock_output(p_ctrl->class_nbr);

          if (status != SL_STATUS_OK) {
            break;
          }

          if (p_setup_req->wLength > report_len) {
            sli_usbd_hid_os_unlock_output(p_ctrl->class_nbr);
            break;
          }

          // Receive report from host.
          status = sl_usbd_core_read_control_sync((void *)p_buf,
                                                  report_len,
                                                  SLI_USBD_HID_CTRL_REQ_TIMEOUT_mS,
                                                  &xfer_len);

          if (status != SL_STATUS_OK) {
            sli_usbd_hid_os_unlock_output(p_ctrl->class_nbr);
            break;
          }

          sli_usbd_hid_os_unlock_output(p_ctrl->class_nbr);

          p_callback->set_output_report(p_ctrl->class_nbr,
                                        report_id,
                                        p_buf,
                                        report_len);

          valid = true;
          break;

        case 3:
          // Feature report.
          if ((p_callback == (sl_usbd_hid_callbacks_t *)0)
              || (p_callback->set_feature_report == NULL)) {
            break;                                              // Stall request.
          }

          status = sli_usbd_hid_report_get_info(&p_ctrl->report,
                                                SLI_USBD_HID_REPORT_TYPE_FEATURE,
                                                report_id,
                                                &p_buf,
                                                &is_largest,
                                                &report_len);

          if (status != SL_STATUS_OK) {
            break;
          }

          if (p_setup_req->wLength != report_len) {
            break;
          }

          // Receive report from host.
          status = sl_usbd_core_read_control_sync((void *)p_buf,
                                                  report_len,
                                                  0,
                                                  &xfer_len);

          if (status != SL_STATUS_OK) {
            break;
          }

          p_callback->set_feature_report(p_ctrl->class_nbr,
                                         report_id,
                                         p_buf,
                                         report_len);

          valid = true;

          break;

        case 0:
        default:
          break;
      }
      break;

    case SLI_USBD_HID_REQ_GET_IDLE:
      if (dev_to_host != true) {
        break;
      }

      w_value = (uint8_t)((p_setup_req->wValue >> 8u) & 0xFFu);

      // Chk if setup req is valid.
      if ((p_setup_req->wLength == 1)
          && (w_value == 0)) {
        report_id = (uint8_t)(p_setup_req->wValue & 0xFFu);

        // Get idle rate (duration).
        status = sli_usbd_hid_report_get_idle_rate(&p_ctrl->report,
                                                   report_id,
                                                   &p_ctrl->ctrl_status_buf_ptr[0]);

        if (status != SL_STATUS_OK) {
          break;
        }

        status = sl_usbd_core_write_control_sync((void *)&p_ctrl->ctrl_status_buf_ptr[0],
                                                 1u,
                                                 SLI_USBD_HID_CTRL_REQ_TIMEOUT_mS,
                                                 false,
                                                 &xfer_len);

        if (status == SL_STATUS_OK) {
          valid = true;
        }
      }
      break;

    case SLI_USBD_HID_REQ_SET_IDLE:
      if (dev_to_host != false) {
        break;
      }

      // Chk if setup req is valid.
      if (p_setup_req->wLength > 0) {
        break;
      }

      idle_rate = (uint8_t)((p_setup_req->wValue >> 8u) & 0xFFu);
      report_id = (uint8_t)(p_setup_req->wValue        & 0xFFu);

      status = sli_usbd_hid_report_set_idle_rate(&p_ctrl->report,
                                                 report_id,
                                                 idle_rate);

      if (status == SL_STATUS_OK) {
        valid = true;
      }
      break;

