espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
    case SLI_USBD_HID_REQ_GET_PROTOCOL:
      if ((p_callback == (sl_usbd_hid_callbacks_t *)0)
          || (p_callback->get_protocol == NULL)) {
        break;                                                  // Stall request.
      }

      if (dev_to_host != true) {
        break;
      }

      // Chk if setup req is valid.
      if ((p_setup_req->wLength != 1)
          || (p_setup_req->wValue != 0)) {
        break;
      }

      //                                                           Get currently active protocol from app.
      p_callback->get_protocol(p_ctrl->class_nbr, &p_ctrl->ctrl_status_buf_ptr[0]);

      // Send active protocol to host (see Note #1e1).
      status = sl_usbd_core_write_control_sync((void *)&p_ctrl->ctrl_status_buf_ptr[0],
                                               1u,
                                               SLI_USBD_HID_CTRL_REQ_TIMEOUT_mS,
                                               false,
                                               &xfer_len);

      if (status == SL_STATUS_OK) {
        valid = true;
      }
      break;

    case SLI_USBD_HID_REQ_SET_PROTOCOL:
      if ((p_callback == (sl_usbd_hid_callbacks_t *)0)
          || (p_callback->set_protocol == NULL)) {
        break;                                                  // Stall request.
      }

      if (dev_to_host != false) {
        break;
      }

      // Chk if setup req is valid.
      if ((p_setup_req->wLength != 0)
          || ((p_setup_req->wValue != 0)
              && (p_setup_req->wValue != 1))) {
        break;
      }

      protocol = (uint8_t)p_setup_req->wValue;

      //                                                           Set new protocol.
      p_callback->set_protocol(p_ctrl->class_nbr, protocol);

      valid = true;
      break;

    default:
      break;
  }

  return (valid);
}

/****************************************************************************************************//**
 *                                           usbd_hid_output_data_complete()
 *
 * @brief    Inform the class about the set report transfer completion on control endpoint.
 *
 * @param    class_nbr   Class instance number.
 *
 * @param    p_buf       Pointer to the receive buffer.
 *
 * @param    buf_len     Receive buffer length.
 *
 * @param    xfer_len    Number of octets received.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status.
 *******************************************************************************************************/
static void usbd_hid_output_data_complete(uint8_t      class_nbr,
                                          void         *p_buf,
                                          uint32_t     buf_len,
                                          uint32_t     xfer_len,
                                          void         *p_arg,
                                          sl_status_t  status)
{
  uint32_t *p_xfer_len;

  (void)&class_nbr;
  (void)&p_buf;
  (void)&buf_len;

  p_xfer_len = (uint32_t *)p_arg;

  if (status == SL_STATUS_OK) {
    *p_xfer_len = xfer_len;
    sli_usbd_hid_os_post_output(class_nbr);
  } else {
    *p_xfer_len = 0;
    sli_usbd_hid_os_pend_abort_output(class_nbr);
  }
}

/****************************************************************************************************//**
 *                                           usbd_hid_read_async_complete()
 *
 * @brief    Inform the application about the Bulk OUT transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the receive buffer.
 *
 * @param    buf_len     Receive buffer length.
 *
 * @param    xfer_len    Number of octets received.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_hid_read_async_complete(uint8_t      ep_addr,
                                         void         *p_buf,
                                         uint32_t     buf_len,
                                         uint32_t     xfer_len,
                                         void         *p_arg,
                                         sl_status_t  status)
{
  sli_usbd_hid_comm_t       *p_comm;
  sli_usbd_hid_ctrl_t       *p_ctrl;
  sl_usbd_hid_async_function_t fnct;
  void                *p_fnct_arg;

  (void)&ep_addr;

  p_comm = (sli_usbd_hid_comm_t *)p_arg;
  p_ctrl = p_comm->ctrl_ptr;
  fnct = p_ctrl->interrupt_read_async_function;
  p_fnct_arg = p_ctrl->interrupt_read_async_arg_ptr;

  // Xfer finished, no more active xfer.
  p_comm->data_interrupt_out_active_transfer = false;

  // Notify app about xfer completion.
  fnct(p_ctrl->class_nbr,
       p_buf,
       buf_len,
       xfer_len,
       p_fnct_arg,
       status);
}

/****************************************************************************************************//**
 *                                           usbd_hid_write_async_complete()
 *
 * @brief    Inform the application about the Bulk IN transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the transmit buffer.
 *
 * @param    buf_len     Transmit buffer length.
 *
 * @param    xfer_len    Number of octets sent.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_hid_write_async_complete(uint8_t      ep_addr,
                                          void         *p_buf,
                                          uint32_t     buf_len,
                                          uint32_t     xfer_len,
                                          void         *p_arg,
                                          sl_status_t  status)
{
  sli_usbd_hid_comm_t *p_comm;
  sli_usbd_hid_ctrl_t *p_ctrl;

  (void)&ep_addr;

