espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/usb/src/sl_usbd_class_hid.c
  p_comm = (sli_usbd_hid_comm_t *)p_arg;
  p_ctrl = (sli_usbd_hid_ctrl_t *)p_comm->ctrl_ptr;

  sli_usbd_hid_os_unlock_tx(p_ctrl->class_nbr);

  // Notify app about xfer completion.
  p_ctrl->interrupt_write_async_function(p_ctrl->class_nbr,
                                         p_buf,
                                         buf_len,
                                         xfer_len,
                                         p_ctrl->interrupt_write_async_arg_ptr,
                                         status);
}

/****************************************************************************************************//**
 *                                           usbd_hid_write_sync_complete()
 *
 * @brief    Inform the class about the Bulk IN transfer completion.
 *
 * @param    ep_addr     Endpoint address.
 *
 * @param    p_buf       Pointer to the transmit buffer.
 *
 * @param    buf_len     Transmit buffer length.
 *
 * @param    xfer_len    Number of octets sent.
 *
 * @param    p_arg       Additional argument provided by application.
 *
 * @param    status      Transfer status: success or error.
 *******************************************************************************************************/
static void usbd_hid_write_sync_complete(uint8_t      ep_addr,
                                         void         *p_buf,
                                         uint32_t     buf_len,
                                         uint32_t     xfer_len,
                                         void         *p_arg,
                                         sl_status_t  status)
{
  sli_usbd_hid_ctrl_t *p_ctrl;
  sli_usbd_hid_comm_t *p_comm;
  uint8_t    class_nbr;

  (void)&ep_addr;
  (void)&p_buf;
  (void)&buf_len;

  p_comm = (sli_usbd_hid_comm_t *)p_arg;
  p_ctrl = p_comm->ctrl_ptr;
  class_nbr = p_ctrl->class_nbr;

  if (status == SL_STATUS_OK) {
    p_ctrl->data_interrupt_in_transfer_len = xfer_len;
    sli_usbd_hid_os_post_input(class_nbr);
  } else {
    p_ctrl->data_interrupt_in_transfer_len = 0;
    sli_usbd_hid_os_pend_abort_input(class_nbr);
  }
}
